# <font color =   #0000cc> <i> Clase 12 Programación I MCD

## <font color= #0000FF> <i> SQL en Python

### <b> <font color=  #c2cc00ff > <i> Creando una Base de Datos desde Python

In [1]:
import pyodbc  #instalar en el prompt de anaconda con pip install pyodbc
import pandas as pd #Contiene funciones que nos ayudan en el análisis de datos

In [ ]:


#CREAR CREDENCIALES DEL SERVIDOR 
# COLOCAR  NOMBRE DEL SERVIDOR, NOMBRE DE USAURIO Y PASSWORD 
server = 'MONTSERRAT' #server = r'MONTSERRAT\SQLEXPRESS'
nombre_usuario = 'sa'
password = 'Japon.12_'

conexion = pyodbc.connect(
    'DRIVER={ODBC Driver 17 for SQL Server};'
    f'SERVER={server};'
    f'UID={nombre_usuario};'
    f'PWD={password};'
)

nombre_usuario = 'sa'
password = 'Japon.12_'

#Crear conexión a SQL SERVER 
try:
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        'SERVER=' + server + ';'
        'UID=' + nombre_usuario + ';'
        'PWD=' + password
    )

    # Muy importante para CREATE DATABASE Debes activar la propiedad despues de crear la conexión
    conexion.autocommit = True  
    print('Conexión exitosa')
    # Crea un cursor, que es un objeto que permite ejecutar comandos SQL dentro de la conexión abierta.
    cursor = conexion.cursor()

    #Crea una base de datos llamada DB_PYTHON.
    cursor.execute("CREATE DATABASE DB_Python")
    print('Base de datos creada correctamente')

    #Cierra la conexión con sql para liberar recursos. 
    conexion.close()
    print('Conexión cerrada')

except Exception as e:
    print('La conexión no fue exitosa')
    print('Error:', e)

Conexión exitosa
La conexión no fue exitosa
Error: ('42000', "[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Database 'DB_Python' already exists. Choose a different database name. (1801) (SQLExecDirectW)")

### <b> <font color=  #c2cc00ff > <i> Creando una Tabla  a partir de un archivo csv

In [3]:
import pandas as pd #Contiene funciones que nos ayudan en el análisis de datos

carreras=pd.read_csv('Maraton NY completo.csv', 
                  engine='python') 
carreras

     Corredor  place  gender  age home        time
0        3475   3592    Male   52  GBR  217.483333
1       13594  13853  Female   40   NY  272.550000
2       12012  12256    Male   31  FRA  265.283333
3       10236  10457  Female   33   MI  256.150000
4        9476   9686    Male   33   NY  252.250000
..        ...    ...     ...  ...  ...         ...
995     15972  16261    Male   61  FRA  285.883333
996      1090   1131    Male   37  GBR  191.916667
997     16419  16713  Female   53  IRL  289.016667
998     13977  14241  Female   21   NY  276.050000
999      8527   8726    Male   55  GER  240.966667

[1000 rows x 6 columns]

In [4]:
(carreras)

     Corredor  place  gender  age home        time
0        3475   3592    Male   52  GBR  217.483333
1       13594  13853  Female   40   NY  272.550000
2       12012  12256    Male   31  FRA  265.283333
3       10236  10457  Female   33   MI  256.150000
4        9476   9686    Male   33   NY  252.250000
..        ...    ...     ...  ...  ...         ...
995     15972  16261    Male   61  FRA  285.883333
996      1090   1131    Male   37  GBR  191.916667
997     16419  16713  Female   53  IRL  289.016667
998     13977  14241  Female   21   NY  276.050000
999      8527   8726    Male   55  GER  240.966667

[1000 rows x 6 columns]

In [5]:
Lista_valores =  carreras.values.tolist()
tuplas_lista = tuple(Lista_valores) 
tuplas_lista

([3475, 3592, 'Male', 52, 'GBR', 217.4833333],
 [13594, 13853, 'Female', 40, 'NY', 272.55],
 [12012, 12256, 'Male', 31, 'FRA', 265.2833333],
 [10236, 10457, 'Female', 33, 'MI', 256.15],
 [9476, 9686, 'Male', 33, 'NY', 252.25],
 [1720, 1784, 'Male', 40, 'NJ', 201.9666667],
 [15736, 16020, 'Female', 30, 'CA', 283.5666667],
 [10580, 10805, 'Male', 27, 'GBR', 255.8833333],
 [11957, 12201, 'Male', 42, 'NED', 264.25],
 [18933, 19266, 'Male', 48, 'B.C', 306.6833333],
 [14956, 15229, 'Female', 63, 'GBR', 281.2666667],
 [14987, 15260, 'Male', 49, 'ITA', 280.25],
 [10447, 10670, 'Male', 33, 'NY', 258.3333333],
 [10435, 10658, 'Male', 43, 'NY', 257.1333333],
 [191, 200, 'Male', 40, 'GER', 163.9333333],
 [9962, 10178, 'Male', 33, 'NY', 253.6166667],
 [2379, 2467, 'Male', 40, 'FRA', 206.2666667],
 [10505, 10729, 'Male', 36, 'NY', 257.9333333],
 [11853, 12093, 'Male', 49, 'SWE', 262.1333333],
 [12181, 12428, 'Female', 34, 'NY', 264.2166667],
 [2633, 2730, 'Male', 26, 'DEN', 209.7333333],
 [11935, 12179, 'Male', 50, 'NED', 265.25],
 [20116, 20460, 'Male', 33, 'NJ', 315.2333333],
 [23043, 23413, 'Male', 71, 'FL', 414.7],
 [19584, 19921, 'Female', 39, 'GER', 309.2666667],
 [11640, 11878, 'Female', 28, 'GBR', 261.2666667],
 [17363, 17683, 'Male', 52, 'GBR', 295.3166667],
 [17611, 17933, 'Male', 28, 'NED', 294.8333333],
 [9935, 10151, 'Male', 52, 'CA', 254.25],
 [8713, 8915, 'Male', 41, 'BRA', 248.95],
 [204, 213, 'Male', 35, 'VA', 164.5],
 [21293, 21647, 'Female', 39, 'NY', 334.0166667],
 [2624, 2721, 'Male', 48, 'FRA', 210.9],
 [14357, 14623, 'Male', 33, 'NED', 271.0666667],
 [4583, 4715, 'Male', 35, 'MA', 226.4666667],
 [10059, 10277, 'Male', 46, 'PR', 256.7166667],
 [12379, 12630, 'Male', 30, 'NY', 264.8333333],
 [3633, 3751, 'Male', 42, 'KY', 219.1333333],
 [6695, 6867, 'Male', 31, 'ITA', 237.7],
 [711, 737, 'Male', 40, 'IL', 184.3],
 [10746, 10972, 'Male', 41, 'NY', 253.75],
 [12716, 12968, 'Male', 33, 'NY', 267.4666667],
 [17454, 17775, 'Male', 37, 'NY', 289.6166667],
 [10114, 10333, 'Female', 25, 'RSA', 256.9666667],
 [16764, 17068, 'Male', 39, 'GBR', 288.0333333],
 [14424, 14690, 'Male', 34, 'NY', 277.4],
 [19915, 20253, 'Female', 42, 'NY', 316.3333333],
 [13047, 13301, 'Male', 44, 'ITA', 271.3666667],
 [8626, 8827, 'Male', 45, 'MA', 248.0833333],
 [805, 836, 'Male', 30, 'NY', 186.45],
 [6955, 7132, 'Male', 33, 'CA', 237.2],
 [20135, 20479, 'Female', 39, 'CAN', 318.6333333],
 [23128, 23499, 'Male', 67, 'GA', 431.6166667],
 [4833, 4969, 'Male', 35, 'GBR', 227.0166667],
 [22111, 22469, 'Female', 42, 'NY', 353.1],
 [15975, 16264, 'Female', 30, 'MA', 284.0166667],
 [22968, 23338, 'Female', 31, 'NY', 407.4333333],
 [9482, 9692, 'Male', 44, 'FRA', 252.6333333],
 [15726, 16010, 'Male', 44, 'MEX', 283.75],
 [3388, 3502, 'Female', 38, 'GBR', 218.3833333],
 [2504, 2596, 'Male', 27, 'MEX', 207.0166667],
 [23231, 23603, 'Female', 58, 'NY', 467.1833333],
 [5755, 5909, 'Male', 36, 'NY', 231.4166667],
 [12426, 12677, 'Male', 36, 'NED', 265.1333333],
 [488, 507, 'Male', 33, 'CT', 177.3666667],
 [16982, 17290, 'Male', 40, 'NY', 292.1333333],
 [5918, 6077, 'Female', 28, 'NY', 234.2],
 [12031, 12275, 'Female', 32, 'NY', 264.5],
 [3855, 3979, 'Male', 36, 'FRA', 221.3833333],
 [8902, 9104, 'Female', 23, 'NY', 247.3166667],
 [6523, 6693, 'Male', 33, 'MA', 236.2333333],
 [6080, 6240, 'Male', 42, 'NY', 235.7333333],
 [15601, 15883, 'Male', 41, 'GBR', 284.25],
 [5617, 5768, 'Female', 40, 'MEX', 232.3833333],
 [11867, 12107, 'Male', 40, 'GBR', 265.1166667],
 [5179, 5322, 'Male', 33, 'ITA', 230.4166667],
 [20590, 20939, 'Female', 25, 'KOR', 327.1666667],
 [20343, 20690, 'Male', 27, 'GBR', 321.55],
 [12955, 13208, 'Male', 51, 'MEX', 268.9666667],
 [10601, 10826, 'Female', 56, 'SWE', 258.5333333],
 [8855, 9057, 'Male', 48, 'GER', 249.2666667],
 [20719, 21068, 'Male', 33, 'NY', 326.9333333],
 [12715, 12967, 'Male', 51, 'GER', 268.1833333],
 [10962, 11191, 'Male', 51, 'RSA', 256.9833333],
 [11270, 11503, 'Male', 32, 'NY', 256.5],
 [11860, 12100, 'Female', 32, 'NY', 263.85],
 [15203, 15480, 'Male', 69, 'FRA', 276.5],
 [18838, 19171, 'Male', 44, 'ITA', 306.4166667],
 [6981, 7158, 'Female', 38, 'GBR', 239.55],
 [11141, 11372, 'Female', 31, 'GBR', 259.2],
 [14695, 14966, 'Male', 53, 'NED', 277.6833333],
 [4450, 4582, 'Male', 44, 'MO', 219.7666667],
 [4675, 4808, 'Male', 44, 'NY', 227.2],
 [13346, 13602, 'Male', 51, 'NM', 272.2166667],
 [400, 417, 'Male', 33, 'NY', 175.3666667],
 [10217, 10437, 'Female', 41, 'GBR', 254.5333333],
 [4993, 5131, 'Male', 33, 'NY', 226.7666667],
 [3476, 3593, 'Male', 32, 'NY', 219.05],
 [1927, 1996, 'Male', 30, 'NZL', 204.6333333],
 [18859, 19192, 'Male', 40, 'GBR', 305.2833333],
 [11424, 11659, 'Male', 60, 'NY', 262.7666667],
 [6944, 7121, 'Male', 42, 'LAN', 238.95],
 [20992, 21344, 'Female', 65, 'JPN', 328.9333333],
 [358, 371, 'Male', 26, 'GER', 173.6],
 [16106, 16397, 'Female', 38, 'GER', 287.6333333],
 [22743, 23112, 'Male', 81, 'ITA', 389.0],
 [4784, 4919, 'Male', 31, 'NJ', 226.8],
 [5647, 5798, 'Female', 33, 'NY', 229.3166667],
 [7941, 8133, 'Male', 61, 'FRA', 244.3],
 [15924, 16212, 'Female', 40, 'NY', 284.8166667],
 [6091, 6251, 'Male', 32, 'IL', 234.5833333],
 [510, 532, 'Male', 66, 'ESP', 178.5833333],
 [11198, 11430, 'Male', 59, 'NY', 262.6833333],
 [11001, 11230, 'Male', 40, 'FRA', 259.2333333],
 [8706, 8908, 'Male', 43, 'MI', 247.95],
 [23003, 23373, 'Male', 18, 'MEX', 408.3333333],
 [535, 558, 'Male', 60, 'ITA', 179.5166667],
 [22810, 23180, 'Female', 36, 'GBR', 394.0833333],
 [9022, 9224, 'Male', 44, 'NJ', 251.3666667],
 [1389, 1441, 'Male', 34, 'MI', 197.2],
 [5362, 5508, 'Male', 41, 'CAN', 230.35],
 [13266, 13522, 'Male', 44, 'PA', 268.4166667],
 [4904, 5041, 'Male', 25, 'NY', 228.2833333],
 [8486, 8685, 'Female', 21, 'FRA', 248.0333333],
 [495, 517, 'Male', 32, 'SUI', 177.7166667],
 [12666, 12918, 'Male', 38, 'NY', 266.8333333],
 [17051, 17360, 'Male', 33, 'NY', 291.3833333],
 [2519, 2613, 'Female', 22, 'OR', 209.0666667],
 [22508, 22873, 'Female', 33, 'TX', 369.35],
 [20736, 21085, 'Male', 61, 'FL', 326.7],
 [11393, 11627, 'Male', 33, 'NY', 258.0333333],
 [22565, 22932, 'Female', 41, 'LA', 371.9833333],
 [20645, 20994, 'Male', 45, 'NY', 325.95],
 [9649, 9862, 'Female', 34, 'CAN', 252.3666667],
 [16182, 16475, 'Male', 36, 'GBR', 286.8166667],
 [493, 515, 'Male', 29, 'ITA', 177.6333333],
 [20643, 20992, 'Male', 43, 'NY', 326.05],
 [14963, 15236, 'Male', 21, 'FL', 276.65],
 [8556, 8756, 'Male', 52, 'DEN', 246.9666667],
 [4751, 4885, 'Female', 41, 'NY', 225.0833333],
 [13853, 14115, 'Male', 59, 'FRA', 273.9833333],
 [13539, 13798, 'Male', 56, 'SUI', 271.9666667],
 [14262, 14528, 'Male', 31, 'NY', 270.6666667],
 [1688, 1752, 'Male', 43, 'NY', 201.95],
 [13459, 13718, 'Female', 27, 'GER', 270.05],
 [20009, 20350, 'Female', 28, 'NJ', 320.5333333],
 [6444, 6613, 'Male', 54, 'FRA', 236.4333333],
 [10527, 10752, 'Male', 38, 'NJ', 258.0],
 [8526, 8725, 'Male', 31, 'MA', 247.4166667],
 [11896, 12137, 'Male', 44, 'VEN', 264.9166667],
 [854, 885, 'Male', 40, 'FRA', 187.4166667],
 [956, 991, 'Male', 35, 'FRA', 189.4666667],
 [23145, 23516, 'Male', 76, 'NY', 430.8166667],
 [23094, 23464, 'Male', 51, 'NY', 426.8833333],
 [17753, 18076, 'Male', 51, 'NY', 297.2],
 [23230, 23602, 'Male', 73, 'NY', 460.8],
 [17141, 17454, 'Female', 53, 'GA', 289.2666667],
 [13212, 13468, 'Female', 29, 'NED', 271.0666667],
 [4447, 4579, 'Male', 42, 'MEX', 223.05],
 [10115, 10334, 'Female', 44, 'NY', 256.4833333],
 [21284, 21638, 'Male', 43, 'CA', 332.2333333],
 [16809, 17113, 'Female', 33, 'FL', 290.3],
 [8510, 8709, 'Male', 47, 'FRA', 247.9333333],
 [1525, 1583, 'Male', 53, 'NJ', 199.5833333],
 [22073, 22431, 'Female', 32, 'GBR', 353.2166667],
 [22509, 22874, 'Female', 51, 'TX', 369.35],
 [19034, 19366, 'Female', 34, 'FRA', 307.5333333],
 [6555, 6725, 'Female', 36, 'NY', 235.0833333],
 [18172, 18501, 'Male', 40, 'GBR', 299.1333333],
 [5076, 5215, 'Male', 48, 'ITA', 229.5166667],
 [13184, 13440, 'Male', 31, 'PER', 271.3666667],
 [14170, 14436, 'Male', 30, 'NY', 274.4333333],
 [9746, 9959, 'Male', 30, 'IL', 251.85],
 [11733, 11973, 'Male', 31, 'GA', 261.8333333],
 [6656, 6828, 'Female', 25, 'NY', 238.3333333],
 [23143, 23514, 'Male', 38, 'IRL', 433.8833333],
 [3849, 3972, 'Female', 44, 'GBR', 220.25],
 [6407, 6576, 'Male', 53, 'GER', 231.8],
 [6593, 6763, 'Male', 38, 'NY', 237.5333333],
 [8282, 8480, 'Female', 42, 'NJ', 244.95],
 [20669, 21018, 'Male', 70, 'JPN', 322.9833333],
 [8622, 8823, 'Female', 20, 'MEX', 244.8833333],
 [5933, 6092, 'Male', 51, 'NJ', 234.0166667],
 [13819, 14081, 'Male', 29, 'MN', 272.9833333],
 [11619, 11857, 'Male', 31, 'MN', 259.6166667],
 [9254, 9457, 'Male', 42, 'FRA', 251.7833333],
 [14824, 15096, 'Female', 33, 'IL', 280.0666667],
 [22506, 22871, 'Female', 32, 'NY', 370.6],
 [14304, 14570, 'Female', 26, 'DC', 277.6],
 [14356, 14622, 'Male', 51, 'FRA', 277.6833333],
 [9697, 9910, 'Male', 53, 'NED', 253.2833333],
 [13837, 14099, 'Female', 28, 'NY', 274.8833333],
 [20516, 20863, 'Female', 24, 'NJ', 324.15],
 [21476, 21831, 'Female', 42, 'CA', 341.7666667],
 [22009, 22365, 'Female', 34, 'NY', 350.25],
 [17221, 17535, 'Female', 55, 'TN', 295.5],
 [8023, 8216, 'Female', 40, 'NC', 245.5166667],
 [17013, 17322, 'Male', 29, 'GBR', 293.6666667],
 [18786, 19119, 'Male', 33, 'GA', 302.55],
 [14521, 14787, 'Female', 30, 'MA', 275.1],
 [15389, 15669, 'Male', 41, 'NY', 282.6],
 [21214, 21568, 'Male', 22, 'NY', 330.5666667],
 [8057, 8250, 'Male', 33, 'DC', 242.15],
 [253, 265, 'Male', 29, 'FIN', 168.1833333],
 [8439, 8638, 'Male', 42, 'NJ', 244.7166667],
 [8107, 8300, 'Female', 32, 'MA', 246.2666667],
 [14984, 15257, 'Female', 20, 'CA', 278.8],
 [347, 359, 'Male', 38, 'FRA', 173.15],
 [14856, 15129, 'Female', 30, 'JPN', 279.8166667],
 [2971, 3077, 'Female', 34, 'NED', 214.6333333],
 [14637, 14906, 'Male', 35, 'GBR', 278.2166667],
 [7947, 8139, 'Female', 30, 'NJ', 244.7666667],
 [12609, 12861, 'Female', 44, 'TX', 268.0666667],
 [13101, 13355, 'Male', 51, 'FRA', 269.95],
 [1259, 1306, 'Male', 44, 'NY', 195.35],
 [13296, 13552, 'Female', 43, 'CA', 272.4],
 [14312, 14578, 'Male', 49, 'CAN', 276.7833333],
 [1544, 1603, 'Male', 42, 'MA', 198.2166667],
 [13172, 13427, 'Male', 32, 'NY', 272.0166667],
 [18088, 18417, 'Female', 35, 'PA', 298.35],
 [11741, 11981, 'Female', 38, 'NY', 262.6833333],
 [20901, 21253, 'Male', 39, 'NED', 330.6166667],
 [12110, 12354, 'Female', 48, 'NOR', 265.4],
 [9335, 9541, 'Male', 36, 'CT', 253.3],
 [4648, 4781, 'Male', 56, 'FRA', 224.65],
 [17361, 17681, 'Female', 31, 'CT', 295.7166667],
 [16803, 17107, 'Female', 30, 'NJ', 291.0666667],
 [3460, 3577, 'Male', 33, 'FL', 218.2833333],
 [17478, 17799, 'Male', 52, 'FL', 289.7],
 [6932, 7109, 'Male', 23, 'GBR', 238.2333333],
 [10380, 10603, 'Male', 39, 'NED', 251.0833333],
 [22333, 22694, 'Male', 49, 'NY', 366.5833333],
 [7087, 7267, 'Male', 32, 'CA', 238.25],
 [2176, 2255, 'Female', 32, 'NY', 207.15],
 [19716, 20054, 'Male', 29, 'ITA', 313.3],
 [19305, 19641, 'Male', 33, 'ITA', 310.7166667],
 [6398, 6567, 'Male', 54, 'GBR', 235.5333333],
 [12038, 12282, 'Male', 36, 'FRA', 265.5],
 [4300, 4429, 'Male', 38, 'VEN', 224.7166667],
 [837, 868, 'Male', 40, 'NY', 186.9166667],
 [7035, 7215, 'Male', 33, 'OH', 239.0666667],
 [18565, 18895, 'Female', 32, 'CA', 300.0166667],
 [13022, 13276, 'Male', 40, 'DEN', 270.0333333],
 [623, 646, 'Male', 24, 'JPN', 181.9],
 [19271, 19607, 'Male', 41, 'NJ', 305.95],
 [23180, 23551, 'Female', 48, 'IRL', 439.8333333],
 [2003, 2075, 'Male', 33, 'NJ', 205.2666667],
 [17850, 18175, 'Male', 67, 'ESP', 296.6333333],
 [10742, 10968, 'Female', 22, 'CA', 258.7],
 [18260, 18589, 'Male', 5, 'NY', 302.6833333],
 [15161, 15436, 'Female', 40, 'NY', 281.1333333],
 [5120, 5260, 'Male', 56, 'ITA', 230.05],
 [8987, 9189, 'Female', 30, 'NY', 248.7666667],
 [5134, 5276, 'Male', 26, 'NY', 227.8],
 [10474, 10698, 'Male', 53, 'NY', 258.15],
 [14177, 14443, 'Female', 38, 'NED', 272.15],
 [7855, 8043, 'Male', 41, 'FRA', 243.6],
 [16822, 17127, 'Male', 54, 'OR', 290.6166667],
 [18998, 19330, 'Male', 43, 'NY', 306.2833333],
 [17059, 17368, 'Female', 24, 'NY', 288.55],
 [991, 1028, 'Male', 34, 'ITA', 189.8166667],
 [10860, 11088, 'Female', 40, 'FL', 257.7833333],
 [10593, 10818, 'Male', 27, 'NY', 259.2833333],
 [23221, 23593, 'Male', 51, 'NY', 454.65],
 [2806, 2906, 'Male', 23, 'NY', 212.65],
 [4576, 4708, 'Female', 43, 'OH', 223.4333333],
 [15630, 15912, 'Male', 41, 'MO', 285.6166667],
 [13884, 14146, 'Male', 40, 'MA', 270.0666667],
 [8782, 8984, 'Male', 47, 'FRA', 247.1333333],
 [10116, 10335, 'Male', 21, 'IRL', 256.2],
 [7241, 7424, 'Female', 30, 'GBR', 239.4166667],
 [4528, 4660, 'Male', 33, 'FL', 226.2333333],
 [22746, 23115, 'Female', 20, 'GBR', 387.4],
 [16932, 17239, 'Male', 55, 'NY', 293.0166667],
 [6007, 6166, 'Male', 32, 'NY', 233.4833333],
 [9897, 10112, 'Female', 31, 'NY', 250.4333333],
 [20111, 20455, 'Female', 31, 'MA', 316.7],
 [16376, 16670, 'Male', 31, 'NJ', 288.8166667],
 [13256, 13512, 'Male', 36, 'NJ', 272.4666667],
 [10377, 10600, 'Female', 36, 'JPN', 258.3333333],
 [20137, 20481, 'Male', 72, 'ARG', 321.8666667],
 [22695, 23063, 'Male', 41, 'LA', 382.9333333],
 [18666, 18997, 'Male', 58, 'NY', 305.7333333],
 [13718, 13979, 'Male', 32, 'GBR', 272.5666667],
 [13120, 13374, 'Female', 35, 'NY', 271.4],
 [20511, 20858, 'Male', 42, 'ITA', 321.35],
 [1943, 2012, 'Female', 30, 'NY', 204.9333333],
 [13451, 13710, 'Male', 33, 'NY', 272.8166667],
 [3563, 3681, 'Male', 44, 'GER', 217.4666667],
 [17033, 17342, 'Female', 32, 'NY', 287.8666667],
 [17444, 17765, 'Male', 38, 'NED', 293.05],
 [2691, 2789, 'Male', 32, 'PA', 210.65],
 [3265, 3378, 'Male', 48, 'CHI', 217.35],
 [6231, 6395, 'Male', 38, 'AUS', 230.75],
 [6766, 6940, 'Male', 31, 'NJ', 237.8833333],
 [3910, 4034, 'Male', 32, 'NY', 221.15],
 [22578, 22945, 'Female', 33, 'NJ', 379.85],
 [22829, 23199, 'Male', 37, 'NJ', 398.2666667],
 [15360, 15639, 'Male', 50, 'NY', 283.7833333],
 [1014, 1054, 'Male', 52, 'PR', 191.05],
 [16775, 17079, 'Female', 33, 'BEL', 290.3333333],
 [5550, 5701, 'Male', 32, 'MA', 230.1],
 [5942, 6101, 'Male', 22, 'GBR', 233.3833333],
 [6233, 6397, 'Male', 43, 'NY', 235.4833333],
 [19089, 19422, 'Male', 34, 'GA', 304.9666667],
 [13834, 14096, 'Male', 46, 'MEX', 273.5166667],
 [19636, 19973, 'Male', 34, 'NY', 315.75],
 [5817, 5974, 'Male', 49, 'MEX', 234.3166667],
 [4517, 4649, 'Male', 31, 'CAN', 225.2833333],
 [9747, 9960, 'Male', 58, 'DEN', 254.2166667],
 [23149, 23520, 'Female', 32, 'GBR', 434.1833333],
 [6742, 6915, 'Male', 42, 'VA', 238.85],
 [5731, 5883, 'Male', 43, 'ITA', 233.75],
 [10932, 11160, 'Male', 43, 'IL', 258.9166667],
 [11627, 11865, 'Male', 41, 'CA', 262.3666667],
 [7895, 8087, 'Male', 30, 'NJ', 244.05],
 [18618, 18949, 'Male', 66, 'GER', 302.5166667],
 [21125, 21478, 'Female', 53, 'FRA', 330.0666667],
 [22241, 22599, 'Male', 30, 'TX', 359.45],
 [19826, 20164, 'Female', 31, 'NJ', 316.0333333],
 [22979, 23349, 'Female', 31, 'CA', 404.55],
 [2452, 2543, 'Male', 33, 'NY', 208.7833333],
 [3565, 3683, 'Female', 30, 'NY', 219.5],
 [5192, 5335, 'Male', 33, 'NY', 229.35],
 [6552, 6722, 'Male', 24, 'NY', 230.5333333],
 [19912, 20250, 'Male', 70, 'MI', 318.05],
 [5705, 5857, 'Female', 27, 'NY', 233.45],
 [23090, 23460, 'Male', 62, 'FL', 423.0166667],
 [20491, 20838, 'Female', 21, 'GBR', 321.2333333],
 [9544, 9757, 'Male', 46, 'VEN', 254.0666667],
 [7568, 7753, 'Female', 33, 'MA', 240.0333333],
 [20973, 21325, 'Male', 46, 'NY', 334.2166667],
 [8784, 8986, 'Male', 50, 'FRA', 247.2833333],
 [3029, 3137, 'Male', 40, 'CT', 214.3666667],
 [14400, 14666, 'Male', 39, 'GBR', 275.9166667],
 [19376, 19712, 'Female', 23, 'NY', 305.6333333],
 [17911, 18237, 'Male', 52, 'ITA', 298.1833333],
 [1759, 1825, 'Male', 36, 'FRA', 202.5333333],
 [13335, 13591, 'Female', 35, 'NY', 268.2333333],
 [2104, 2181, 'Male', 29, 'WA', 205.1833333],
 [19588, 19925, 'Male', 29, 'IL', 312.5],
 [3521, 3638, 'Male', 53, 'FRA', 218.9666667],
 [3443, 3559, 'Male', 44, 'PA', 218.6666667],
 [20774, 21124, 'Male', 46, 'FRA', 325.6],
 [17786, 18111, 'Male', 54, 'NY', 295.2],
 [15923, 16211, 'Male', 41, 'NY', 284.4],
 [9204, 9407, 'Male', 47, 'VEN', 251.9666667],
 [10297, 10520, 'Female', 40, 'NY', 258.4],
 [8476, 8675, 'Male', 42, 'GER', 247.1666667],
 [21197, 21551, 'Male', 37, 'GBR', 332.8166667],
 [4329, 4458, 'Female', 31, 'IL', 224.8666667],
 [8416, 8615, 'Male', 50, 'FRA', 242.2666667],
 [1702, 1766, 'Male', 35, 'CHI', 201.4666667],
 [6966, 7143, 'Male', 50, 'WA', 239.0833333],
 [18374, 18703, 'Male', 40, 'VA', 298.3333333],
 [15515, 15795, 'Male', 32, 'DC', 283.7666667],
 [11573, 11810, 'Male', 62, 'ITA', 263.2],
 [19246, 19581, 'Male', 46, 'FIN', 305.9],
 [8114, 8307, 'Male', 34, 'ITA', 244.5666667],
 [15339, 15618, 'Female', 30, 'NY', 282.25],
 [969, 1004, 'Male', 26, 'NY', 189.8833333],
 [5161, 5304, 'Male', 31, 'CAN', 230.1333333],
 [19162, 19496, 'Male', 55, 'NY', 310.2],
 [21070, 21422, 'Male', 58, 'ITA', 332.6833333],
 [5892, 6051, 'Female', 41, 'ITA', 234.3],
 [16603, 16905, 'Male', 47, 'NED', 285.2833333],
 [23282, 23654, 'Male', 69, 'NY', 508.0833333],
 [17737, 18060, 'Male', 33, 'GA', 296.45],
 [4793, 4928, 'Male', 54, 'MD', 226.4333333],
 [9378, 9586, 'Male', 53, 'NC', 246.85],
 [22207, 22565, 'Male', 50, 'AZ', 359.4666667],
 [4318, 4447, 'Male', 46, 'GER', 224.4166667],
 [7605, 7790, 'Male', 31, 'VA', 241.5666667],
 [13406, 13664, 'Male', 35, 'SUI', 266.45],
 [17597, 17918, 'Male', 43, 'NY', 291.6166667],
 [6037, 6196, 'Male', 32, 'TX', 234.0166667],
 [861, 892, 'Female', 30, 'CA', 187.7333333],
 [21157, 21510, 'Female', 56, 'FRA', 333.2833333],
 [20271, 20617, 'Female', 21, 'GBR', 319.0333333],
 [19547, 19884, 'Male', 41, 'NY', 313.3666667],
 [18714, 19045, 'Female', 33, 'TX', 305.3],
 [9778, 9991, 'Male', 30, 'GBR', 250.8],
 [2222, 2303, 'Male', 23, 'NY', 206.5666667],
 [9260, 9463, 'Female', 30, 'MD', 250.95],
 [12686, 12938, 'Male', 34, 'NY', 264.9833333],
 [16292, 16586, 'Male', 39, 'TX', 288.0666667],
 [21799, 22154, 'Female', 32, 'NY', 350.7833333],
 [22640, 23008, 'Male', 50, 'CA', 379.3],
 [22378, 22742, 'Female', 31, 'TX', 363.4666667],
 [3018, 3126, 'Male', 40, 'NY', 215.1333333],
 [9178, 9380, 'Male', 48, 'NOR', 251.8333333],
 [21467, 21822, 'Male', 36, 'CT', 343.6],
 [7728, 7915, 'Male', 34, 'MEX', 240.6833333],
 [21586, 21941, 'Male', 69, 'SD', 339.05],
 [17523, 17844, 'Male', 47, 'PER', 295.5166667],
 [13894, 14156, 'Female', 29, 'DEN', 274.2333333],
 [14366, 14632, 'Female', 49, 'FRA', 277.7666667],
 [4367, 4496, 'Male', 40, 'FRA', 224.8],
 [19024, 19356, 'Male', 60, 'GER', 302.4666667],
 [12549, 12800, 'Male', 37, 'GBR', 265.7666667],
 [3695, 3814, 'Female', 36, 'CT', 220.5833333],
 [2734, 2833, 'Male', 34, 'ITA', 212.1666667],
 [7725, 7912, 'Male', 30, 'MA', 242.4],
 [10426, 10649, 'Female', 33, 'NY', 258.9666667],
 [14628, 14897, 'Male', 39, 'NY', 277.55],
 [21569, 21924, 'Male', 50, 'NY', 339.9833333],
 [9373, 9581, 'Male', 32, 'NJ', 253.3166667],
 [16144, 16437, 'Female', 33, 'VA', 287.4666667],
 [20740, 21089, 'Male', 42, 'NY', 330.4166667],
 [4243, 4370, 'Male', 48, 'ESP', 224.5333333],
 [8386, 8585, 'Male', 61, 'NJ', 247.75],
 [796, 827, 'Male', 36, 'ITA', 186.3833333],
 [8331, 8529, 'Male', 30, 'NY', 245.4],
 [286, 298, 'Male', 33, 'NY', 169.6666667],
 [9128, 9330, 'Male', 48, 'OR', 249.2],
 [476, 495, 'Male', 46, 'FRA', 177.6166667],
 [11496, 11732, 'Male', 51, 'FRA', 261.8],
 [21089, 21441, 'Male', 52, 'NY', 330.8],
 [4643, 4776, 'Male', 36, 'NED', 225.45],
 [20945, 21297, 'Female', 43, 'NJ', 328.0],
 [17339, 17658, 'Male', 32, 'NY', 292.8666667],
 [11719, 11959, 'Female', 40, 'AUT', 262.95],
 [15579, 15860, 'Female', 34, 'CAN', 283.8],
 [19993, 20334, 'Male', 22, 'SC', 313.1666667],
 [13314, 13570, 'Female', 30, 'CAN', 270.2],
 [16212, 16506, 'Female', 33, 'NED', 284.4],
 [13088, 13342, 'Female', 22, 'VA', 268.5166667],
 [21900, 22255, 'Female', 33, 'PER', 347.6333333],
 [354, 367, 'Male', 43, 'CA', 173.3666667],
 [19880, 20218, 'Female', 50, 'SWE', 316.5666667],
 [7823, 8010, 'Female', 41, 'CAN', 244.45],
 [12431, 12682, 'Male', 31, 'NY', 266.1],

In [6]:
type(tuplas_lista)

tuple

In [7]:
import pyodbc

server = 'Montserrat'
bd = 'DB_PYTHON'


try:
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        'SERVER=' + server + ';'
        'DATABASE=' + bd + ';'
        'Trusted_Connection=yes'
    )
    conexion.autocommit = True  #Necesario para CREATE TABLE sin errores
    print('Conexión exitosa')

    cursor = conexion.cursor()
    
    # Crear tabla (si no existe)
    cursor.execute("""
        IF OBJECT_ID('MaratonNY_Python', 'U') IS NULL
        CREATE TABLE MaratonNY_Python(
            Corredor INTEGER PRIMARY KEY,
            place INTEGER,
            gender VARCHAR(25),
            age INTEGER,
            home VARCHAR(255),
            tiempo FLOAT
        )
    """)
    
    # Insertar datos
    cursor.executemany("INSERT INTO MaratonNY_Python VALUES(?,?,?,?,?,?)", tuplas_lista)
    
    # Guardar cambios
    conexion.commit()
    
    print('Datos insertados correctamente')

    conexion.close()
    print('Conexión cerrada')

except Exception as e:
    print('Error:', e)

Conexión exitosa
Error: ('23000', "[23000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Violation of PRIMARY KEY constraint 'PK__MaratonN__1EDF5E1CC9E9DBBB'. Cannot insert duplicate key in object 'dbo.MaratonNY_Python'. The duplicate key value is (3475). (2627) (SQLExecDirectW); [23000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]The statement has been terminated. (3621)")

## <font color= #0000FF> <i> Consultas de SQL en Python

### <b> <font color=  #c2cc00ff > <i> Select y From

In [8]:


server = 'MONTSERRAT'
bd = 'DB_Python'

try:                               
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        'SERVER=' + server + ';'
        'DATABASE=' + bd + ';'
        'Trusted_Connection=yes'
    )
    print('Conexión exitosa')
except Exception as e: 
    print('La conexión no fue exitosa')
    print('Error:', e)

# Leer datos
maraton_todos = pd.read_sql("SELECT * FROM MaratonNY_Python", conexion)
maraton_edad = pd.read_sql("SELECT age FROM MaratonNY_Python", conexion)
maraton_edad_gender = pd.read_sql("SELECT age, gender FROM MaratonNY_Python", conexion)

conexion.close()
print('Conexión cerrada')

Conexión exitosa
Conexión cerrada

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2458185249.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  maraton_todos = pd.read_sql("SELECT * FROM MaratonNY_Python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2458185249.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  maraton_edad = pd.read_sql("SELECT age FROM MaratonNY_Python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2458185249.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  maraton_edad_gender = pd.read_sql("SELECT age, gender FROM MaratonNY_Python", conexion)

In [9]:
maraton_todos

     Corredor  place  gender  age home      tiempo
0          53     54    Male   37   AK  147.333333
1         100    104    Male   27   NJ  156.000000
2         112    116    Male   43   CO  157.583333
3         191    200    Male   40  GER  163.933333
4         204    213    Male   35   VA  164.500000
..        ...    ...     ...  ...  ...         ...
995     23255  23627    Male   45  GBR  478.016667
996     23269  23641    Male   40  IRL  491.566667
997     23273  23645  Female   46   NY  501.550000
998     23282  23654    Male   69   NY  508.083333
999     23290  23662  Female   69   NY  566.783333

[1000 rows x 6 columns]

In [10]:
maraton_edad

     age
0     37
1     27
2     43
3     40
4     35
..   ...
995   45
996   40
997   46
998   69
999   69

[1000 rows x 1 columns]

In [11]:
maraton_edad_gender

     age  gender
0     37    Male
1     27    Male
2     43    Male
3     40    Male
4     35    Male
..   ...     ...
995   45    Male
996   40    Male
997   46  Female
998   69    Male
999   69  Female

[1000 rows x 2 columns]

### <b> <font color=  #6600CC > <i> Where, igual a, diferente a, Like y Not Like

In [12]:
import pandas as pd
import pyodbc

# Leer el archivo Excel
ruta_excel = r"Datos_Personales_Python.xlsx"
Inf = pd.read_excel(ruta_excel, engine='openpyxl')

# Convertir todo a texto para evitar errores de tipo
Inf = Inf.fillna('').astype(str)

# Convertir DataFrame a lista de tuplas
tuplas_lista = [tuple(x) for x in Inf.values.tolist()]

# Configurar conexión
server = 'MONTSERRAT'
bd = 'DB_PYTHON'

try:
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )
    conexion.autocommit = True
    print('Conexión exitosa')

    cursor = conexion.cursor()

    # Crear la tabla si no existe
    cursor.execute("""
        IF OBJECT_ID('Datos_Personales_Python', 'U') IS NULL
        CREATE TABLE Datos_Personales_Python (
            Id_num INT PRIMARY KEY,
            Nombre NVARCHAR(100),
            Correo NVARCHAR(100),
            Direccion NVARCHAR(150),
            Ciudad NVARCHAR(100),
            Telefono NVARCHAR(20),
            Genero NVARCHAR(20),
            Estado_Civil NVARCHAR(20)
        )
    """)

    # Insertar o actualizar datos
    cursor.executemany("""
        MERGE INTO Datos_Personales_Python AS destino
        USING (SELECT ? AS Id_num, ? AS Nombre, ? AS Correo, ? AS Direccion, 
                      ? AS Ciudad, ? AS Telefono, ? AS Genero, ? AS Estado_Civil) AS origen
        ON destino.Id_num = origen.Id_num
        WHEN MATCHED THEN
            UPDATE SET 
                Nombre = origen.Nombre,
                Correo = origen.Correo,
                Direccion = origen.Direccion,
                Ciudad = origen.Ciudad,
                Telefono = origen.Telefono,
                Genero = origen.Genero,
                Estado_Civil = origen.Estado_Civil
        WHEN NOT MATCHED THEN
            INSERT VALUES (origen.Id_num, origen.Nombre, origen.Correo, origen.Direccion,
                           origen.Ciudad, origen.Telefono, origen.Genero, origen.Estado_Civil);
    """, tuplas_lista)

    conexion.commit()
    print('Datos cargados correctamente en SQL Server')

except Exception as e:
    print('Error:', e)

finally:
    if 'conexion' in locals():
        conexion.close()
        print('Conexión cerrada')

Conexión exitosa
Datos cargados correctamente en SQL Server
Conexión cerrada

In [13]:
import pandas as pd
import pyodbc

server = 'Montserrat'
bd = 'DB_Python'
    
try:
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )
    print('Conexión exitosa')

    # Consultas SQL correctamente referenciadas
    Casados = pd.read_sql(
        "SELECT * FROM dbo.Datos_Personales_Python WHERE Estado_Civil = 'Married';", 
        conexion
    )

    No_Casados = pd.read_sql(
        "SELECT * FROM dbo.Datos_Personales_Python WHERE Estado_Civil != 'Married';", 
        conexion
    )

    gmail = pd.read_sql(
        "SELECT * FROM dbo.Datos_Personales_Python WHERE Correo LIKE '%gmail%';", 
        conexion
    )

    alumnos_A = pd.read_sql(
        "SELECT * FROM dbo.Datos_Personales_Python WHERE Nombre LIKE 'A%';", 
        conexion
    )

    alumnos_not_A = pd.read_sql(
        "SELECT * FROM dbo.Datos_Personales_Python WHERE Nombre NOT LIKE 'A%';", 
        conexion
    )
    nombres_correos = pd.read_sql(
        "SELECT Nombre, Correo FROM dbo.Datos_Personales_Python",
        conexion
    )
    registros_Leicester = pd.read_sql(
        "SELECT Nombre, Ciudad FROM dbo.Datos_Personales_Python WHERE Ciudad LIKE 'Leicester%';", 
        conexion
    ) 
    lada_8 = pd.read_sql(
        "SELECT Nombre, Telefono FROM dbo.Datos_Personales_Python WHERE Nombre LIKE '8%';", 
        conexion
    )   
    # Mostrar resultados de ejemplo
    print("Casados:")
    print(Casados.head(), "\n")

    print("Correos Gmail:")
    print(gmail.head())

except Exception as e: 
    print('La conexión no fue exitosa o hubo un error en la consulta')
    print('Error:', e)

finally:
    if 'conexion' in locals():
        conexion.close()
        print('Conexión cerrada')

Conexión exitosa
Casados:
   Id_num         Nombre                       Correo  \
0       4  Ariel Hermann       rfgxqoso9811@gmail.com
1       5    Adam Maddox  Violette_Maxey368@gmail.com
2       6     Alida Jobe            Raynor8@gmail.com
3      12  Aurion Stumpf            Gable@hotmail.com
4      19        Valeria         valeria946@gmail.com

                   Direccion      Ciudad        Telefono Genero Estado_Civil
0       683 SW Stonewood Way  Brigantine  (552) 037-7186      M      Married
1      2254 W Riverview Lane     Merrill  (247) 811-3933      F      Married
2  959 East Meadowview Drive  Snoqualmie  (610) 362-5075      M      Married
3                   Aberdeen    Plymouth  (535) 013-0514      F      Married
4              Calle 23 #503      Mérida   (321) 498-497      F      Married

Correos Gmail:
   Id_num            Nombre                       Correo  \
0       1  Adolph Francisco           gndd9978@gmail.com
1       2      Adah Jameson    Ivan.Southern98@gmail.com
2       3         Adam Geer   Darell_Centeno27@gmail.com
3       4     Ariel Hermann       rfgxqoso9811@gmail.com
4       5       Adam Maddox  Violette_Maxey368@gmail.com

               Direccion           Ciudad        Telefono Genero Estado_Civil
0   3755 Red Burwood Way      Mount Horeb  (451) 929-8321      M       Single
1                         Bedford Heights  (914) 159-1651      M       Single
2     402 Bayview Avenue         Aberdeen  (961) 069-2786      M       Single
3   683 SW Stonewood Way       Brigantine  (552) 037-7186      M      Married
4  2254 W Riverview Lane          Merrill  (247) 811-3933      F      Married
Conexión cerrada

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Casados = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  No_Casados = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  gmail = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:32: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  alumnos_A = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:37: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  alumnos_not_A = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:41: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nombres_correos = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:45: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  registros_Leicester = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3468765802.py:49: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  lada_8 = pd.read_sql(

In [14]:
Casados

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,4,Ariel Hermann,rfgxqoso9811@gmail.com,683 SW Stonewood Way,Brigantine,(552) 037-7186,M,Married
1,5,Adam Maddox,Violette_Maxey368@gmail.com,2254 W Riverview Lane,Merrill,(247) 811-3933,F,Married
2,6,Alida Jobe,Raynor8@gmail.com,959 East Meadowview Drive,Snoqualmie,(610) 362-5075,M,Married
3,12,Aurion Stumpf,Gable@hotmail.com,Aberdeen,Plymouth,(535) 013-0514,F,Married
4,19,Valeria,valeria946@gmail.com,Calle 23 #503,Mérida,(321) 498-497,F,Married
5,21,Jaime,jaime938@gmail.com,Calle 127 #806,Guadalajara,(577) 163-560,F,Married
6,25,Claudia,claudia372@gmail.com,Calle 83 #265,Cancún,(379) 937-469,M,Married
7,26,Karen,karen304@gmail.com,Calle 199 #504,Toluca,(538) 892-789,F,Married
8,28,Cristina,cristina448@gmail.com,Calle 73 #957,Toluca,(888) 527-572,M,Married
9,29,Daniel,daniel182@gmail.com,Calle 126 #902,Mérida,(275) 275-286,M,Married
10,30,Eduardo,eduardo141@gmail.com,Calle 150 #488,Leicester,(390) 126-160,F,Married
11,32,Zulema,zulema996@gmail.com,Calle 121 #961,Toluca,(567) 824-229,M,Married
12,51,Teresa,teresa286@gmail.com,Calle 48 #549,Cancún,(993) 997-208,M,Married
13,52,Valeria,valeria181@gmail.com,Calle 123 #435,Toluca,(363) 800-403,F,Married
14,55,Teresa,teresa680@gmail.com,Calle 120 #123,Querétaro,(719) 637-754,M,Married
15,63,Pamela,pamela575@gmail.com,Calle 174 #438,Puebla,(201) 696-760,M,Married
16,65,Sergio,sergio388@gmail.com,Calle 32 #352,Cancún,(893) 285-371,F,Married
17,73,Marcos,marcos337@gmail.com,Calle 47 #723,Querétaro,(541) 703-863,M,Married
18,77,Jaime,jaime693@gmail.com,Calle 188 #854,Guadalajara,(970) 790-207,M,Married
19,79,Fernanda,fernanda380@gmail.com,Calle 33 #266,CDMX,(483) 714-971,M,Married
20,84,Victor,victor967@gmail.com,Calle 134 #956,Leicester,(556) 712-372,M,Married
21,85,Nora,nora579@gmail.com,Calle 69 #594,Leicester,(264) 774-385,M,Married
22,87,Gerardo,gerardo285@gmail.com,Calle 78 #734,Toluca,(240) 585-962,M,Married
23,89,Kevin,kevin806@gmail.com,Calle 44 #920,Mérida,(264) 744-720,M,Married

In [15]:
No_Casados

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,1,Adolph Francisco,gndd9978@gmail.com,3755 Red Burwood Way,Mount Horeb,(451) 929-8321,M,Single
1,2,Adah Jameson,Ivan.Southern98@gmail.com,,Bedford Heights,(914) 159-1651,M,Single
2,3,Adam Geer,Darell_Centeno27@gmail.com,402 Bayview Avenue,Aberdeen,(961) 069-2786,M,Single
3,7,Alphonso Meeks,Nannie_Farr@outlook.com,2621 Mountain Circle,Cahokia,(447) 684-3013,F,Single
4,8,Aimee Stamm,mcvgy02@gmail.com,806 Rose Hill Highway,Clarksville,,M,
...,...,...,...,...,...,...,...,...
61,82,Ulises,ulises334@gmail.com,Calle 86 #803,Mérida,(201) 747-751,F,Single
62,83,Jaime,jaime757@gmail.com,Calle 139 #291,Mérida,(723) 481-648,M,Single
63,86,Nora,nora871@gmail.com,Calle 43 #340,Cancún,(355) 486-506,F,Divorced
64,88,Marcos,marcos227@gmail.com,Calle 142 #871,Toluca,(655) 125-455,M,Widowed
65,90,Jorge,jorge795@gmail.com,Calle 20 #303,Cancún,(554) 436-709,M,Widowed

In [16]:
gmail

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,1,Adolph Francisco,gndd9978@gmail.com,3755 Red Burwood Way,Mount Horeb,(451) 929-8321,M,Single
1,2,Adah Jameson,Ivan.Southern98@gmail.com,,Bedford Heights,(914) 159-1651,M,Single
2,3,Adam Geer,Darell_Centeno27@gmail.com,402 Bayview Avenue,Aberdeen,(961) 069-2786,M,Single
3,4,Ariel Hermann,rfgxqoso9811@gmail.com,683 SW Stonewood Way,Brigantine,(552) 037-7186,M,Married
4,5,Adam Maddox,Violette_Maxey368@gmail.com,2254 W Riverview Lane,Merrill,(247) 811-3933,F,Married
...,...,...,...,...,...,...,...,...
75,86,Nora,nora871@gmail.com,Calle 43 #340,Cancún,(355) 486-506,F,Divorced
76,87,Gerardo,gerardo285@gmail.com,Calle 78 #734,Toluca,(240) 585-962,M,Married
77,88,Marcos,marcos227@gmail.com,Calle 142 #871,Toluca,(655) 125-455,M,Widowed
78,89,Kevin,kevin806@gmail.com,Calle 44 #920,Mérida,(264) 744-720,M,Married
79,90,Jorge,jorge795@gmail.com,Calle 20 #303,Cancún,(554) 436-709,M,Widowed

In [17]:
alumnos_A

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,1,Adolph Francisco,gndd9978@gmail.com,3755 Red Burwood Way,Mount Horeb,(451) 929-8321,M,Single
1,2,Adah Jameson,Ivan.Southern98@gmail.com,,Bedford Heights,(914) 159-1651,M,Single
2,3,Adam Geer,Darell_Centeno27@gmail.com,402 Bayview Avenue,Aberdeen,(961) 069-2786,M,Single
3,4,Ariel Hermann,rfgxqoso9811@gmail.com,683 SW Stonewood Way,Brigantine,(552) 037-7186,M,Married
4,5,Adam Maddox,Violette_Maxey368@gmail.com,2254 W Riverview Lane,Merrill,(247) 811-3933,F,Married
5,6,Alida Jobe,Raynor8@gmail.com,959 East Meadowview Drive,Snoqualmie,(610) 362-5075,M,Married
6,7,Alphonso Meeks,Nannie_Farr@outlook.com,2621 Mountain Circle,Cahokia,(447) 684-3013,F,Single
7,8,Aimee Stamm,mcvgy02@gmail.com,806 Rose Hill Highway,Clarksville,,M,
8,9,Adine Abicht,Ivan.Southern98@hotmail.com,,Peterborough,(914) 159-1651,M,Single
9,10,Amrei Menger,GregoryMurrell@hotmail.com,Presque Isle,Newcastle upon Tyne,(790) 495-8216,F,Single
10,11,Armgard Gerngross,Sanderson@hotmail.com,El Monte,Coventry,(594) 490-9628,M,Divorced
11,12,Aurion Stumpf,Gable@hotmail.com,Aberdeen,Plymouth,(535) 013-0514,F,Married
12,13,Abeline Gelen,Sipes449@hotmail.com,Amsterdam,Swindon,(243) 459-7372,M,Single
13,14,Adriane Finkelstein,Daily37@hotmail.com,Warwick,Norwich,(403) 014-5022,F,Single
14,15,Avenell Rüdiger,uvrguf247@outlook.com,Olympia Fields,Eastbourne,(821) 308-8608,F,Single
15,16,Annalena Genkel,Jewel.Albers24@outlook.com,Lewisville,Portsmouth,(864) 550-3567,F,
16,17,Almute Ebert,mcvgy02@hotmail.com,Katy,Reading,,M,

In [18]:
alumnos_not_A

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,18,Raul,raul181@gmail.com,Calle 79 #164,Guadalajara,(713) 389-188,F,Divorced
1,19,Valeria,valeria946@gmail.com,Calle 23 #503,Mérida,(321) 498-497,F,Married
2,20,Daniel,daniel465@gmail.com,Calle 154 #221,Guadalajara,(534) 889-280,F,Single
3,21,Jaime,jaime938@gmail.com,Calle 127 #806,Guadalajara,(577) 163-560,F,Married
4,22,Zulema,zulema845@gmail.com,Calle 196 #701,Querétaro,(691) 173-795,F,Single
...,...,...,...,...,...,...,...,...
68,86,Nora,nora871@gmail.com,Calle 43 #340,Cancún,(355) 486-506,F,Divorced
69,87,Gerardo,gerardo285@gmail.com,Calle 78 #734,Toluca,(240) 585-962,M,Married
70,88,Marcos,marcos227@gmail.com,Calle 142 #871,Toluca,(655) 125-455,M,Widowed
71,89,Kevin,kevin806@gmail.com,Calle 44 #920,Mérida,(264) 744-720,M,Married
72,90,Jorge,jorge795@gmail.com,Calle 20 #303,Cancún,(554) 436-709,M,Widowed

<b> <i> <font color=  #FF6600 > Ejercicio 1

De la base de datos Datos_Personales_Python obtén lo siguiente:
    

Los nombres y los correos de las personas registradas en la Tabla 

Los registros de las personas que viven en la ciudad llamada Leicester

Los registros cuya clave lada comience con 8

In [19]:
import pandas as pd
import pyodbc

server = 'MONTSERRAT'
bd = 'DB_Python'
    
try:
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )
    print('Conexión exitosa')

    # Consultas SQL correctamente referenciadas
    Nombre_correos = pd.read_sql(
        "SELECT Nombre, Correo FROM dbo.Datos_Personales_Python;", 
        conexion
    )

    Ciudad = pd.read_sql(
        "SELECT * FROM dbo.Datos_Personales_Python WHERE Ciudad = 'Leicester';", 
        conexion
    )

    lada_8 = pd.read_sql(
        "SELECT * FROM dbo.Datos_Personales_Python WHERE Telefono LIKE '(8%';", 
        conexion
    )

   

    # Mostrar resultados de ejemplo
    print("Nombre y correos:")
    print(Nombre_correos.head(), "\n")

    print("Ciudad:")
    print(Ciudad.head())

    print("lada con 8:")
    print(lada_8.head())

except Exception as e: 
    print('La conexión no fue exitosa o hubo un error en la consulta')
    print('Error:', e)

finally:
    if 'conexion' in locals():
        conexion.close()
        print('Conexión cerrada')

Conexión exitosa
Nombre y correos:
             Nombre                       Correo
0  Adolph Francisco           gndd9978@gmail.com
1      Adah Jameson    Ivan.Southern98@gmail.com
2         Adam Geer   Darell_Centeno27@gmail.com
3     Ariel Hermann       rfgxqoso9811@gmail.com
4       Adam Maddox  Violette_Maxey368@gmail.com

Ciudad:
   Id_num   Nombre                Correo       Direccion     Ciudad  \
0      30  Eduardo  eduardo141@gmail.com  Calle 150 #488  Leicester
1      39  Mariana  mariana103@gmail.com  Calle 175 #334  Leicester
2      49     Raul     raul477@gmail.com   Calle 45 #147  Leicester
3      59   Carmen   carmen718@gmail.com  Calle 191 #779  Leicester
4      60  Yolanda  yolanda878@gmail.com  Calle 171 #938  Leicester

        Telefono Genero Estado_Civil
0  (390) 126-160      F      Married
1  (652) 472-942      M      Widowed
2  (464) 681-126      M     Divorced
3  (788) 615-245      M     Divorced
4  (462) 886-721      M     Divorced
lada con 8:
   Id_num           Nombre                      Correo       Direccion  \
0      15  Avenell Rüdiger       uvrguf247@outlook.com  Olympia Fields
1      16  Annalena Genkel  Jewel.Albers24@outlook.com      Lewisville
2      23            Jaime          jaime637@gmail.com  Calle 101 #551
3      28         Cristina       cristina448@gmail.com   Calle 73 #957
4      34            Zaira          zaira378@gmail.com   Calle 65 #470

       Ciudad        Telefono Genero Estado_Civil
0  Eastbourne  (821) 308-8608      F       Single
1  Portsmouth  (864) 550-3567      F
2      Cancún   (819) 852-432      M     Divorced
3      Toluca   (888) 527-572      M      Married
4   Querétaro   (800) 129-462      M       Single
Conexión cerrada

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2183617383.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Nombre_correos = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2183617383.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Ciudad = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2183617383.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  lada_8 = pd.read_sql(

In [20]:
Nombre_correos

              Nombre                       Correo
0   Adolph Francisco           gndd9978@gmail.com
1       Adah Jameson    Ivan.Southern98@gmail.com
2          Adam Geer   Darell_Centeno27@gmail.com
3      Ariel Hermann       rfgxqoso9811@gmail.com
4        Adam Maddox  Violette_Maxey368@gmail.com
..               ...                          ...
85              Nora            nora871@gmail.com
86           Gerardo         gerardo285@gmail.com
87            Marcos          marcos227@gmail.com
88             Kevin           kevin806@gmail.com
89             Jorge           jorge795@gmail.com

[90 rows x 2 columns]

In [21]:
Ciudad

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,30,Eduardo,eduardo141@gmail.com,Calle 150 #488,Leicester,(390) 126-160,F,Married
1,39,Mariana,mariana103@gmail.com,Calle 175 #334,Leicester,(652) 472-942,M,Widowed
2,49,Raul,raul477@gmail.com,Calle 45 #147,Leicester,(464) 681-126,M,Divorced
3,59,Carmen,carmen718@gmail.com,Calle 191 #779,Leicester,(788) 615-245,M,Divorced
4,60,Yolanda,yolanda878@gmail.com,Calle 171 #938,Leicester,(462) 886-721,M,Divorced
5,67,Yolanda,yolanda606@gmail.com,Calle 140 #480,Leicester,(787) 288-570,M,Single
6,78,Jaime,jaime417@gmail.com,Calle 2 #315,Leicester,(971) 808-511,F,Divorced
7,84,Victor,victor967@gmail.com,Calle 134 #956,Leicester,(556) 712-372,M,Married
8,85,Nora,nora579@gmail.com,Calle 69 #594,Leicester,(264) 774-385,M,Married

In [22]:
lada_8

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,15,Avenell Rüdiger,uvrguf247@outlook.com,Olympia Fields,Eastbourne,(821) 308-8608,F,Single
1,16,Annalena Genkel,Jewel.Albers24@outlook.com,Lewisville,Portsmouth,(864) 550-3567,F,
2,23,Jaime,jaime637@gmail.com,Calle 101 #551,Cancún,(819) 852-432,M,Divorced
3,28,Cristina,cristina448@gmail.com,Calle 73 #957,Toluca,(888) 527-572,M,Married
4,34,Zaira,zaira378@gmail.com,Calle 65 #470,Querétaro,(800) 129-462,M,Single
5,38,Fernanda,fernanda922@gmail.com,Calle 157 #715,Guadalajara,(886) 150-108,F,Widowed
6,41,Cristina,cristina441@gmail.com,Calle 163 #783,Querétaro,(835) 126-293,M,Divorced
7,65,Sergio,sergio388@gmail.com,Calle 32 #352,Cancún,(893) 285-371,F,Married
8,76,Ramon,ramon421@gmail.com,Calle 178 #299,Puebla,(884) 187-763,M,Widowed
9,81,Fabiola,fabiola973@gmail.com,Calle 113 #597,CDMX,(882) 888-542,F,Single

### <b> <font color=  #6600CC > <i> Filtrando información numérica

In [23]:
import pyodbc
import pandas as pd

server = 'MONTSERRAT'
bd = 'DB_Python'

try:                               
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )
    print('Conexión exitosa')

    # Consulta 1: Personas mayores o iguales a 30 años
    mayores_30 = pd.read_sql("SELECT * FROM MaratonNY_Python WHERE age >= 30", conexion)

    # Consulta 2: Personas entre 30 y 40 años
    edad_between = pd.read_sql("SELECT * FROM MaratonNY_Python WHERE age BETWEEN 30 AND 40", conexion)

    print(mayores_30.head())  # muestra primeros registros

except Exception as e:
    print('La conexión no fue exitosa:', e)

finally:
    if 'conexion' in locals() and conexion:
        conexion.close()
        print("Conexión cerrada correctamente.")

Conexión exitosa
   Corredor  place gender  age home      tiempo
0        53     54   Male   37   AK  147.333333
1       112    116   Male   43   CO  157.583333
2       191    200   Male   40  GER  163.933333
3       204    213   Male   35   VA  164.500000
4       218    228   Male   33  ESP  165.516667
Conexión cerrada correctamente.

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1492274411.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  mayores_30 = pd.read_sql("SELECT * FROM MaratonNY_Python WHERE age >= 30", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1492274411.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  edad_between = pd.read_sql("SELECT * FROM MaratonNY_Python WHERE age BETWEEN 30 AND 40", conexion)

In [24]:
mayores_30

     Corredor  place  gender  age home      tiempo
0          53     54    Male   37   AK  147.333333
1         112    116    Male   43   CO  157.583333
2         191    200    Male   40  GER  163.933333
3         204    213    Male   35   VA  164.500000
4         218    228    Male   33  ESP  165.516667
..        ...    ...     ...  ...  ...         ...
851     23255  23627    Male   45  GBR  478.016667
852     23269  23641    Male   40  IRL  491.566667
853     23273  23645  Female   46   NY  501.550000
854     23282  23654    Male   69   NY  508.083333
855     23290  23662  Female   69   NY  566.783333

[856 rows x 6 columns]

In [25]:
edad_between

     Corredor  place  gender  age home      tiempo
0          53     54    Male   37   AK  147.333333
1         191    200    Male   40  GER  163.933333
2         204    213    Male   35   VA  164.500000
3         218    228    Male   33  ESP  165.516667
4         286    298    Male   33   NY  169.666667
..        ...    ...     ...  ...  ...         ...
438     23143  23514    Male   38  IRL  433.883333
439     23149  23520  Female   32  GBR  434.183333
440     23157  23528    Male   35  IRL  436.233333
441     23250  23622    Male   33   NY  475.366667
442     23269  23641    Male   40  IRL  491.566667

[443 rows x 6 columns]

### <b> <font color=  #6600CC > <i> Filtrando información numérica y no numérica

In [26]:
import pyodbc
import pandas as pd

server = 'MONTSERRAT'
bd = 'DB_Python'

try:
    # Establecer conexión
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )
    print('Conexión exitosa')

    # Consulta con AND
    combinada = pd.read_sql(
        "SELECT * FROM MaratonNY_Python WHERE age > 45 AND gender = 'Female' AND tiempo < 250",
        conexion
    )

    # Consulta con OR
    combinada_or = pd.read_sql(
        "SELECT * FROM MaratonNY_Python  WHERE ((age > 45 AND gender = 'Female') OR (age > 55 AND gender = 'Male')) AND tiempo < 250",
        conexion
    )
# Consulta con mujeresNyk Ejercicio 2
    mujer_nyk = pd.read_sql(
        "SELECT * FROM MaratonNY_Python WHERE gender = 'Female' AND home = 'NY' AND tiempo < 250",
        conexion
    )
# Consulta con hommujITA Ejercicio 2
    hommujITA = pd.read_sql(
        "SELECT * FROM MaratonNY_Python WHERE home = 'ITA' AND tiempo > 300",
        conexion
    )   
    print('Consulta AND ejecutada correctamente')
    print('Consulta OR ejecutada correctamente')

except Exception as e:
    print('La conexión no fue exitosa')
    print('Error:', e)

finally:
    if 'conexion' in locals() and conexion:
        conexion.close()
        print('Conexión cerrada correctamente')

Conexión exitosa
Consulta AND ejecutada correctamente
Consulta OR ejecutada correctamente
Conexión cerrada correctamente

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3310787971.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  combinada = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3310787971.py:24: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  combinada_or = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3310787971.py:29: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  mujer_nyk = pd.read_sql(
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3310787971.py:34: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  hommujITA = pd.read_sql(

In [27]:
combinada

   Corredor  place  gender  age home      tiempo
0      7863   8051  Female   46   NY  244.850000
1      8697   8899  Female   53  AUS  249.383333

In [28]:
combinada_or

    Corredor  place  gender  age home      tiempo
0        510    532    Male   66  ESP  178.583333
1        535    558    Male   60  ITA  179.516667
2        582    605    Male   57  PAR  180.750000
3       2238   2319    Male   61  VEN  207.166667
4       4648   4781    Male   56  FRA  224.650000
5       4690   4823    Male   64  JPN  227.416667
6       5120   5260    Male   56  ITA  230.050000
7       6038   6197    Male   58  GBR  234.316667
8       7508   7693    Male   57  FRA  240.466667
9       7863   8051  Female   46   NY  244.850000
10      7941   8133    Male   61  FRA  244.300000
11      8386   8585    Male   61   NJ  247.750000
12      8697   8899  Female   53  AUS  249.383333
13      9683   9896    Male   60  GER  249.033333

<b> <i> <font color=  #FF6600 > Ejercicio 2

De la base de datos MaratonNY obtén lo siguiente:
    
Las mujeres Neoyorquinas que participaron en la carrera

Los hombres y mujeres provenientes de italia que hayan hecho más de 300 minutos en llegar a la meta

In [29]:
mujer_nyk

    Corredor  place  gender  age home      tiempo
0        408    425  Female   26   NY  175.533333
1       1234   1281  Female   35   NY  194.950000
2       1943   2012  Female   30   NY  204.933333
3       2176   2255  Female   32   NY  207.150000
4       3257   3370  Female   23   NY  217.483333
5       3520   3637  Female   31   NY  219.433333
6       3565   3683  Female   30   NY  219.500000
7       3871   3995  Female   30   NY  221.516667
8       3889   4013  Female   32   NY  221.916667
9       4437   4568  Female   25   NY  225.583333
10      4751   4885  Female   41   NY  225.083333
11      4853   4989  Female   22   NY  227.400000
12      5647   5798  Female   33   NY  229.316667
13      5705   5857  Female   27   NY  233.450000
14      5918   6077  Female   28   NY  234.200000
15      6216   6380  Female   27   NY  235.900000
16      6555   6725  Female   36   NY  235.083333
17      6591   6761  Female   33   NY  236.083333
18      6656   6828  Female   25   NY  238.333333
19      7006   7184  Female   41   NY  237.183333
20      7863   8051  Female   46   NY  244.850000
21      7999   8192  Female   32   NY  243.150000
22      8059   8252  Female   25   NY  245.483333
23      8348   8546  Female   32   NY  245.183333
24      8686   8888  Female   22   NY  249.316667
25      8902   9104  Female   23   NY  247.316667
26      8987   9189  Female   30   NY  248.766667

In [30]:
hommujITA

    Corredor  place gender  age home      tiempo
0      18838  19171   Male   44  ITA  306.416667
1      19305  19641   Male   33  ITA  310.716667
2      19396  19732   Male   43  ITA  311.566667
3      19666  20003   Male   57  ITA  315.766667
4      19716  20054   Male   29  ITA  313.300000
5      20511  20858   Male   42  ITA  321.350000
6      21070  21422   Male   58  ITA  332.683333
7      21601  21956   Male   33  ITA  339.683333
8      22722  23090   Male   63  ITA  385.166667
9      22743  23112   Male   81  ITA  389.000000
10     23162  23533   Male   70  ITA  440.766667

### <b> <font color=  #c2cc00ff > <i> Select dentro de Select

In [65]:
import pyodbc
import pandas as pd

server = 'MONTSERRAT'
bd = 'DB_Python'
try:
    # Conexión correcta
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )
    print('Conexión exitosa') 

    # Consulta SQL corregida
    Veloz_mujer_aus = pd.read_sql(
        """
        SELECT age, gender, tiempo
        FROM MaratonNY_Python
        WHERE tiempo <= (
            SELECT MIN(tiempo)
            FROM MaratonNY_Python
            WHERE gender = 'Female' AND home = 'AUS'
        )
        AND gender = 'Female'
        """,
        conexion
    )

    print("Consulta ejecutada correctamente")
    print(Veloz_mujer_aus)

except Exception as e:
    print("La conexión no fue exitosa")
    print("Error:", e)

finally:
    if 'conexion' in locals() and conexion:
        conexion.close()
        print("Conexión cerrada correctamente")

Conexión exitosa
Consulta ejecutada correctamente
    age  gender      tiempo
0    26  Female  175.533333
1    30  Female  187.733333
2    42  Female  190.933333
3    36  Female  193.316667
4    35  Female  194.950000
..  ...     ...         ...
65   20  Female  244.883333
66   22  Female  249.316667
67   53  Female  249.383333
68   23  Female  247.316667
69   30  Female  248.766667

[70 rows x 3 columns]
Conexión cerrada correctamente

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\483810675.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Veloz_mujer_aus = pd.read_sql(

In [32]:
Veloz_mujer_aus

    age  gender      tiempo
0    26  Female  175.533333
1    30  Female  187.733333
2    42  Female  190.933333
3    36  Female  193.316667
4    35  Female  194.950000
..  ...     ...         ...
65   20  Female  244.883333
66   22  Female  249.316667
67   53  Female  249.383333
68   23  Female  247.316667
69   30  Female  248.766667

[70 rows x 3 columns]

In [33]:
conexion = pyodbc.connect(
    'DRIVER={ODBC Driver 17 for SQL Server};'
    'SERVER=MONTSERRAT;DATABASE=DB_Python;Trusted_Connection=yes;'
)
print("Conectado")

# Varias consultas
df1 = pd.read_sql("SELECT TOP 5 * FROM MaratonNY_python", conexion)
df2 = pd.read_sql("SELECT COUNT(*) AS total FROM MaratonNY_python", conexion)

print(df1)
print(df2)

# Al final de todo tu notebook
conexion.close()

Conectado
   Corredor  place gender  age home      tiempo
0        53     54   Male   37   AK  147.333333
1       100    104   Male   27   NJ  156.000000
2       112    116   Male   43   CO  157.583333
3       191    200   Male   40  GER  163.933333
4       204    213   Male   35   VA  164.500000
   total
0   1000

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2643499589.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql("SELECT TOP 5 * FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2643499589.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql("SELECT COUNT(*) AS total FROM MaratonNY_python", conexion)

In [34]:

server = 'MONTSERRAT'
bd = 'DB_Python'

try:                                
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )                          
    print('Conexión exitosa')

except Exception as e: 
    print('La conexión no fué exitosa')
    print('Error:', e)
    
# Consulta
hombres_mujer_aus = pd.read_sql(
    """
    SELECT age, gender, home, tiempo 
    FROM MaratonNY_Python 
    WHERE tiempo >= (
        SELECT tiempo 
        FROM MaratonNY_Python 
        WHERE gender = 'Female' AND home = 'AUS'
    ) 
    AND gender = 'Male'
    """, 
    conexion
)



# Nos aseguramos de cerrar la conexión 
conexion.close()
print('Conexión cerrada correctamente')

Conexión exitosa
Conexión cerrada correctamente

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\845505730.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  hombres_mujer_aus = pd.read_sql(

In [35]:
hombres_mujer_aus

     age gender home      tiempo
0     53   Male  NED  249.683333
1     44   Male   NJ  251.366667
2     22   Male   VT  250.716667
3     30   Male   NY  251.583333
4     48   Male  NOR  251.833333
..   ...    ...  ...         ...
386   73   Male   NY  460.800000
387   33   Male   NY  475.366667
388   45   Male  GBR  478.016667
389   40   Male  IRL  491.566667
390   69   Male   NY  508.083333

[391 rows x 4 columns]

### <b> <font color=  #6600CC > <i> Ordenando la Información

ORDER BY

In [36]:
import pyodbc
import pandas as pd

server = 'MONTSERRAT'
bd = 'DB_Python'

try:                                
    # Conexión corregida
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )                          
    print('Conexión exitosa')

except Exception as e: 
    print('La conexión no fué exitosa')
    print('Error:', e)

# Consulta SQL
hombres_mujer_aus = pd.read_sql(
    """
    SELECT age, gender, home, tiempo 
    FROM MaratonNY_python 
    WHERE tiempo >= (
        SELECT tiempo 
        FROM MaratonNY_python 
        WHERE gender = 'Female' AND home = 'AUS'
    ) 
    AND gender = 'Male' 
    ORDER BY tiempo DESC
    """,
    conexion
)


# Nos aseguramos de cerrar la conexión
conexion.close()
print("Conexión cerrada correctamente")

Conexión exitosa
Conexión cerrada correctamente

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\57804890.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  hombres_mujer_aus = pd.read_sql(

In [37]:
hombres_mujer_aus

     age gender home      tiempo
0     69   Male   NY  508.083333
1     40   Male  IRL  491.566667
2     45   Male  GBR  478.016667
3     33   Male   NY  475.366667
4     73   Male   NY  460.800000
..   ...    ...  ...         ...
386   41   Male  GER  250.916667
387   30   Male  GBR  250.800000
388   22   Male   VT  250.716667
389   33   Male   CA  250.150000
390   53   Male  NED  249.683333

[391 rows x 4 columns]

In [38]:
import pyodbc
import pandas as pd

# Variables de conexión
server = 'MONTSERRAT'
bd = 'DB_Python'

try:                                
    # Conexión correcta con pyodbc
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )                          
    print('Conexión exitosa')

except Exception as e: 
    print('La conexión no fue exitosa')
    print('Error:', e)

# Consulta SQL
hombres_mujer_aus = pd.read_sql(
    """
    SELECT age, gender, home, tiempo
    FROM MaratonNY_python 
    WHERE tiempo >= (
        SELECT tiempo 
        FROM MaratonNY_python 
        WHERE gender = 'Female' AND home = 'AUS'
    ) 
    AND gender = 'Male' 
    ORDER BY age, tiempo DESC
    """,
    conexion
)



# Cerrar la conexión
conexion.close()
print("Conexión cerrada correctamente")

Conexión exitosa
Conexión cerrada correctamente

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\823254974.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  hombres_mujer_aus = pd.read_sql(

In [39]:
hombres_mujer_aus

     age gender home      tiempo
0      5   Male   NY  302.683333
1     18   Male  MEX  408.333333
2     20   Male  GBR  284.083333
3     21   Male   CT  329.250000
4     21   Male   FL  276.650000
..   ...    ...  ...         ...
386   72   Male   ID  254.833333
387   73   Male   NY  460.800000
388   73   Male   NJ  400.716667
389   76   Male   NY  430.816667
390   81   Male  ITA  389.000000

[391 rows x 4 columns]

### <b> <font color=  #c2cc00ff > <i> Extrayendo valores únicos con el comando Distinct

In [40]:

import pyodbc
import pandas as pd

server = 'MONTSERRAT'
bd = 'DB_Python'

try:                                
    # Conexión correcta con pyodbc
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )                          
    print('Conexión exitosa')

except Exception as e: 
    print('La conexión no fue exitosa')
    print('Error:', e)

# Consulta SQL para valores únicos
valores_unicos = pd.read_sql(
    "SELECT DISTINCT home FROM MaratonNY_python ORDER BY home",
    conexion
)



# Cerrar la conexión
conexion.close()
print("Conexión cerrada correctamente ")

Conexión exitosa
Conexión cerrada correctamente

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3631234234.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  valores_unicos = pd.read_sql(

In [41]:
valores_unicos

   home
0    AK
1   ARG
2   AUS
3   AUT
4    AZ
..  ...
67   VA
68  VEN
69   VT
70   WA
71   WI

[72 rows x 1 columns]

### <b> <font color=  #c2cc00ff > <i> Funciones de Agrupamiento (sum, count, min, max y average)

In [42]:
import pyodbc
import pandas as pd

server = 'MONTSERRAT'
bd = 'DB_Python'

try:                                
    # Conexión correcta con pyodbc
    conexion = pyodbc.connect(
        'DRIVER={ODBC Driver 17 for SQL Server};'
        f'SERVER={server};'
        f'DATABASE={bd};'
        'Trusted_Connection=yes;'
    )                          
    print('Conexión exitosa')

except Exception as e: 
    print('La conexión no fue exitosa')
    print('Error:', e)

# Consultas SQL
suma = pd.read_sql("SELECT SUM(tiempo) AS suma FROM MaratonNY_python", conexion)
cantidades = pd.read_sql("SELECT COUNT(tiempo) AS cantidad FROM MaratonNY_python", conexion)
minimo = pd.read_sql("SELECT MIN(tiempo) AS minimo FROM MaratonNY_python", conexion)
maximo = pd.read_sql("SELECT MAX(tiempo) AS maximo FROM MaratonNY_python", conexion)
promedio = pd.read_sql("SELECT AVG(tiempo) AS promedio FROM MaratonNY_python", conexion)
cantidad_paises = pd.read_sql("SELECT COUNT(DISTINCT(home)) AS total_paises FROM MaratonNY_python", conexion)

#Edades Ejercicio 4
sumaed = pd.read_sql("SELECT SUM(age) AS suma FROM MaratonNY_python", conexion)
cantidadesed = pd.read_sql("SELECT COUNT(age) AS cantidades FROM MaratonNY_python", conexion)
minimoed = pd.read_sql("SELECT MIN(age) AS minimo FROM MaratonNY_python", conexion)
maximoed = pd.read_sql("SELECT MAX(age) AS maximo FROM MaratonNY_python", conexion)
promedioed = pd.read_sql("SELECT AVG(age) AS promedio FROM MaratonNY_python", conexion)

# Cerrar la conexión
conexion.close()
print("Conexión cerrada correctamente ")

Conexión exitosa

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  suma = pd.read_sql("SELECT SUM(tiempo) AS suma FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cantidades = pd.read_sql("SELECT COUNT(tiempo) AS cantidad FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:24: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  minimo = pd.read_sql("SELECT MIN(tiempo) AS minimo FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  maximo = pd.read_sql("SELECT MAX(tiempo) AS maximo FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:26: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  promedio = pd.read_sql("SELECT AVG(tiempo) AS promedio FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cantidad_paises = pd.read_sql("SELECT COUNT(DISTINCT(home)) AS total_paises FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:30: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sumaed = pd.read_sql("SELECT SUM(age) AS suma FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cantidadesed = pd.read_sql("SELECT COUNT(age) AS cantidades FROM MaratonNY_python", conexion)

Conexión cerrada correctamente

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:32: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  minimoed = pd.read_sql("SELECT MIN(age) AS minimo FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:33: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  maximoed = pd.read_sql("SELECT MAX(age) AS maximo FROM MaratonNY_python", conexion)
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\2476357630.py:34: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  promedioed = pd.read_sql("SELECT AVG(age) AS promedio FROM MaratonNY_python", conexion)

In [43]:
suma

       suma
0  268570.7

In [44]:
type(suma)

pandas.core.frame.DataFrame

In [45]:
print(f'La suma de los tiempos es {suma.iloc[0][0]}')
print(f'La cantidad de tiempos registrados es {cantidades.iloc[0][0]}')
print(f'El tiempo mínimo registrado es {minimo.iloc[0][0]}')
print(f'El tiempo máximo registrado es {maximo.iloc[0][0]}')
print(f'El tiempo promedio registrado es {promedio.iloc[0][0]}')
print(f'En el maratón participaron {cantidad_paises.iloc[0][0]} paises')

La suma de los tiempos es 268570.70000049984
La cantidad de tiempos registrados es 1000
El tiempo mínimo registrado es 147.3333333
El tiempo máximo registrado es 566.7833333
El tiempo promedio registrado es 268.57070000049987
En el maratón participaron 72 paises

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1826684677.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'La suma de los tiempos es {suma.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1826684677.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'La cantidad de tiempos registrados es {cantidades.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1826684677.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'El tiempo mínimo registrado es {minimo.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1826684677.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'El tiempo máximo registrado es {maximo.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1826684677.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'El tiempo promedio registrado es {promedio.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\1826684677.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'En el maratón participaron {cantidad_paises.iloc[0][0]} paises')

<b> <i> <font color=  #FF6600 > Ejercicio 4

Aplica estas funciones de agrupamiento a la información correspondiente a las edades de los corredores y despliega cada una en pantalla con su leyenda correspondiente

In [46]:
print(f'La suma de las edades es {sumaed.iloc[0][0]}')
print(f'La cantidad de personas registrados es {cantidadesed.iloc[0][0]}')
print(f'La edad mínima registrada es {minimoed.iloc[0][0]}')
print(f'La edad máxima registrada es {maximoed.iloc[0][0]}')
print(f'El promedio de edad registrado es {promedioed.iloc[0][0]}')

La suma de las edades es 39100
La cantidad de personas registrados es 1000
La edad mínima registrada es 5
La edad máxima registrada es 81
El promedio de edad registrado es 39

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3216070340.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'La suma de las edades es {sumaed.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3216070340.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'La cantidad de personas registrados es {cantidadesed.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3216070340.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'La edad mínima registrada es {minimoed.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3216070340.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'La edad máxima registrada es {maximoed.iloc[0][0]}')
C:\Users\monts\AppData\Local\Temp\ipykernel_6996\3216070340.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f'El promedio de edad registrado es {promedioed.iloc[0][0]}')

<b> <font color=  #FF00FF > <i> Accesando a los valores de un dataframe con loc e iloc

Pandas tiene dos funciones que permiten accesar más fácilmente a la información contenida en un Dataframe

Estas dos funciones son loc e iloc

Cuando conocemos los nombres de las filas y las columnas, podemos utilizar la función loc y cuando no los conocemos o queremos hacer referencia a las mismas por medio de números, utilizamos iloc (la "i" hace referencia a "integer")

<b> <font color=  #FF00FF > <i> Ejemplos con iloc

In [47]:
carreras

     Corredor  place  gender  age home        time
0        3475   3592    Male   52  GBR  217.483333
1       13594  13853  Female   40   NY  272.550000
2       12012  12256    Male   31  FRA  265.283333
3       10236  10457  Female   33   MI  256.150000
4        9476   9686    Male   33   NY  252.250000
..        ...    ...     ...  ...  ...         ...
995     15972  16261    Male   61  FRA  285.883333
996      1090   1131    Male   37  GBR  191.916667
997     16419  16713  Female   53  IRL  289.016667
998     13977  14241  Female   21   NY  276.050000
999      8527   8726    Male   55  GER  240.966667

[1000 rows x 6 columns]

In [48]:
type(carreras)

pandas.core.frame.DataFrame

In [49]:
carreras[1,2] #Aún cuando "carreras" es un dataframe, este código nos arrojará un error

KeyError: (1, 2)

In [50]:
carreras.iloc[1][2] #Para obtener la información que se encuentra en la fila 1, columna 2, utilizamos iloc

C:\Users\monts\AppData\Local\Temp\ipykernel_6996\310206883.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  carreras.iloc[1][2] #Para obtener la información que se encuentra en la fila 1, columna 2, utilizamos iloc

'Female'

In [51]:
carreras.iloc[1,2] #Para obtener la información que se encuentra en la fila 1, columna 2, utilizamos iloc

'Female'

In [52]:
carreras.loc[1]["gender"] #Aquí utilizamos el número uno para la fila debido a que las filas no tienen un nombre

'Female'

In [53]:
carreras.iloc[1] #Para obtener la información que se encuentra en la fila 1

Corredor     13594
place        13853
gender      Female
age             40
home            NY
time        272.55
Name: 1, dtype: object

In [54]:
carreras.iloc[2:5] #Trae las filas 2 a 4

   Corredor  place  gender  age home        time
2     12012  12256    Male   31  FRA  265.283333
3     10236  10457  Female   33   MI  256.150000
4      9476   9686    Male   33   NY  252.250000

In [55]:
carreras.iloc[2:5, [2,3]] #Trae las filas 2 a 4, pero solamente las columnas gender y age

   gender  age
2    Male   31
3  Female   33
4    Male   33

In [56]:
carreras.iloc[2:5, 2:5] #Trae las filas 2 a 4 y las columnas de gender a age 
                        #Cuando se le pide un rango de valores no se utilizan corchetes
                        #Los rangos toman en cuenta un número menos en la cifra que se encuentra a la derecha de los dos puntos

   gender  age home
2    Male   31  FRA
3  Female   33   MI
4    Male   33   NY

In [57]:
carreras.iloc[[2,5], [2,5]] #Trae las filas 2 y 5, y las columnas gender y time (la segunda y la quinta)

  gender        time
2   Male  265.283333
5   Male  201.966667

In [58]:
carreras.set_index("Corredor", inplace=True) #Con set_index le indicamos que la columna Corredor contiene los nombres de las filas
                                             #Con inplace=True le indicamos que el cambio se quedará guardado en el dataframe Carreras

In [59]:
carreras.loc[13594,"gender"] #Ahora que ya las filas tienen un nombre, podemos pasarle el número de corredor en las filas

'Female'

In [60]:
carreras.loc[13594,["gender", "age", "home","time"]]

gender    Female
age           40
home          NY
time      272.55
Name: 13594, dtype: object

In [61]:
carreras.loc[13594,"gender":"time"]

gender    Female
age           40
home          NY
time      272.55
Name: 13594, dtype: object

In [62]:
carreras.loc[13594:9476, "gender":"time"]

          gender  age home        time
Corredor
13594     Female   40   NY  272.550000
12012       Male   31  FRA  265.283333
10236     Female   33   MI  256.150000
9476        Male   33   NY  252.250000

In [63]:
carreras.iloc[1:5, 1:5] #En las columnas, ahora gender ya es la número 1 debido a que Corredor ya es un indice y no una columna

          gender  age home        time
Corredor
13594     Female   40   NY  272.550000
12012       Male   31  FRA  265.283333
10236     Female   33   MI  256.150000
9476        Male   33   NY  252.250000

<b> <i> <font color=  #FF6600 > Ejercicio 5

Vuelve a cargar la información del archivo MaratonNY y obtén la información correspondiente a las columnas place y time utilizando tanto la función loc como  la función iloc

In [ ]:
carreras

In [ ]:
carreras.set_index("place", inplace=True)

In [ ]:
carreras

In [ ]:
carreras.iloc[2:5, 1:5]

In [ ]:
carreras.loc[16261:8726, "time"]

## <font color= #0000FF> <i> Tarea

Aplicar cada una de estas funciones en la información contenida en la base de datos que creaste en la tarea número 11